washingtonxr/PSOC63_ULF_ComDemo/CE220291_TCPWM_Square_Wave01/CE220291_TCPWM_Square_Wave01.cydsn/codegentemp/cyfitter_sysint_cfg.h
/*******************************************************************************
* File Name: cyfitter_sysint_cfg.h
* 
* PSoC Creator  4.2
*
* Description:
* 
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#ifndef INCLUDED_CYFITTER_SYSINT_CFG_H
#define INCLUDED_CYFITTER_SYSINT_CFG_H

#include "sysint/cy_sysint.h"

/* ARM CM4 */
#if (((__CORTEX_M == 4) && (CY_CORE_ID == 0)))
    #define SysInt_SW__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_SW_cfg;

    #define SysInt_SW3__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_SW3_cfg;

    #define UART_DEBUG_SCB_IRQ__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t UART_DEBUG_SCB_IRQ_cfg;

    #define SysInt_Tick__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_Tick_cfg;

    #define SysInt_ULFBasebandCnt__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_ULFBasebandCnt_cfg;

    #define SysInt_ULFMainCnt__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_ULFMainCnt_cfg;

    #define SysInt_ULFCarrierCnt__INTC_ASSIGNED 1u
    extern const cy_stc_sysint_t SysInt_ULFCarrierCnt_cfg;

#endif /* ((__CORTEX_M == 4) && (CY_CORE_ID == 0)) */


#endif /* INCLUDED_CYFITTER_SYSINT_CFG_H */
